package 美团;

/**
 * @Author Li Yang
 * @Date 22/04/02 11:30
 * @Version 1.0
 */
public class Main5 {

    /**
     * 可旋转矩阵
     *
     * n×n 个整数，排成n行，每行n个，这样就组成了一个方阵。
     * 小团喜欢无论从四个方向看上去都一模一样的方阵，也就是说，
     * 把这个方阵旋转90度若干次，它都和旋转前一模一样。
     *
     * 而小美有能力改变方阵里面数的值，但这需要花费一定时间。
     * 每把一个位置的数增大或减小1，所花费的时间都是1秒。
     * 现在小美想要改到这个矩阵让小团满意，但她也希望节省自己的时间，请计算要达到目标，所需要的最短时间。
     *
     * 输入描述
     * 第一行一个整数 n，1 <= n <= 100;
     * 后面n行，每行n个空格隔开的整数 aij，0 <= aij <= 109。
     * 输出描述
     * 一个整数，表示所需要的最小时间
     *
     * 样例输入
     * 3
     * 2 1 2
     * 1 1 3
     * 2 1 1
     * 样例输出
     * 3
     *
     * 提示
     * 例如，在样例中，将矩阵改为如下，总花费时间为3.
     *
     * 2 1 2
     * 1 1 1
     * 2 1 2
     *
     * @param args
     */
    public static void main(String[] args) {

    }
}
